practice-for-ch-rails-ninety-nine-cats1-long-practice-main/ninety-nine-cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        cat = Cat.find(params[:id])